Repository: asahraouiia/podman-drupal11
Catalog: src/web/modules/custom/*/*_diagnostic/translations/*.po
Languages: fr

source: Energy consumption
fr: Consommations énergétiques

source: kWh/m²/year
fr: kWh/m²/an

source: Greenhouse gas emissions
fr: Émissions de gaz à effet de serre

source: kg CO₂/m²/year
fr: kg CO₂/m²/an

source: Label
fr: Libellé

source: Unit
fr: Unité

source: The human-readable name of this diagnostic type.
fr: Le nom lisible de ce type de diagnostic.

source: Unit of measurement (e.g., kWh/m²/an, kg CO₂/m²/an).
fr: Unité de mesure (par ex., kWh/m²/an, kg CO₂/m²/an).

source: Energy Classes Configuration
fr: Configuration des classes énergétiques

source: Define the energy classes with labels, colors, and maximum range values. Drag rows to reorder. The last class should have an empty range max.
fr: Définissez les classes énergétiques avec libellés, couleurs et valeurs maximales. Glissez les lignes pour réorganiser. La dernière classe doit avoir une valeur maximale vide.

source: Color
fr: Couleur

source: Range Max
fr: Valeur max

source: Weight
fr: Poids

source: Operations
fr: Opérations

source: No classes defined yet.
fr: Aucune classe définie pour l'instant.

source: Remove
fr: Supprimer

source: Leave empty for last class
fr: Laisser vide pour la dernière classe

source: Add new class
fr: Ajouter une nouvelle classe

source: Class code
fr: Code de classe

source: Add class
fr: Ajouter la classe

source: At least one class must be defined.
fr: Au moins une classe doit être définie.

source: Label is required for class @code.
fr: Le libellé est requis pour la classe @code.

source: Invalid color format for class @code. Use hex format (e.g., #00A651).
fr: Format de couleur invalide pour la classe @code. Utilisez le format hexadécimal (par ex., #00A651).

source: Created the %label diagnostic type.
fr: Type de diagnostic %label créé.

source: Updated the %label diagnostic type.
fr: Type de diagnostic %label mis à jour.

source: Edit
fr: Modifier

source: Delete
fr: Supprimer
